Tekla.Structures.Dialog.UIControls.ProfileCatalog
The ProfileCatalog class represents a group of controls to select profiles
using the profile catalogs.

Tekla.Structures.Dialog.UIControls.ProfileCatalog.#ctor
Initiates a new instance of the control.

Tekla.Structures.Dialog.UIControls.ProfileCatalog.#ctor(System.String)
Initiates a new instance of the control selecting the given profile.
Profile: The profile string that will
be selecteed in the dialog.

Tekla.Structures.Dialog.UIControls.ProfileCatalog.OnSelectClicked(System.Object,System.EventArgs)
Opens the profile catalog dialog for selecting a profile.
Sender:
EventArgs:

Tekla.Structures.Dialog.UIControls.ProfileCatalog.SelectedProfile
The selected profile in the control.

Tekla.Structures.Dialog.UIControls.ProfileCatalog.ButtonText
Gets and sets the text of the button control.

Tekla.Structures.Dialog.UIControls.ProfileCatalog.OnLoad(System.EventArgs)
The profile catalog control is only localized when it is not in design mode,
meaning it is shown without localization in Visual Studio.
EventArgs: The event arguments.

Tekla.Structures.Dialog.UIControls.ProfileCatalog.SelectClicked
The SelectClicked event is raised when the Select button is clicked.

Tekla.Structures.Dialog.UIControls.ProfileCatalog.SelectionDone
The SelectionDone event is raised when the profile selection dialog is closed.
Remarks:
Please note that when filling in controls programmatically, the bound attribute is not stored automatically.
The attribute has to be set using the Tekla.Structures.Dialog.FormBase.SetAttributeValue(System.Windows.Forms.Control,System.Object) method of
the Tekla.Structures.Dialog.FormBase class.

Tekla.Structures.Dialog.UIControls.ProfileCatalog.components
Required designer variable.

Tekla.Structures.Dialog.UIControls.ProfileCatalog.Dispose(System.Boolean)
Cleans up any resources being used.
disposing: True if managed resources should be disposed; otherwise, false.

Tekla.Structures.Dialog.UIControls.ProfileCatalog.InitializeComponent
Required method for Designer support - do not modify
the contents of this method with the code editor.